betaflight/betaflight/src/platform/common/stm32/config_flash.c
#if defined(X32M7)
#define X32_FLASH_ERASE_SIZE FLASH_PAGE_SIZE

static bool x32ConfigAddressIsValid(uintptr_t address, size_t length)
{
    const uintptr_t configStart = (uintptr_t)&__config_start;
    const uintptr_t configEnd = (uintptr_t)&__config_end;

    return length <= (UINTPTR_MAX - address) &&
        address >= configStart &&
        (address + length) <= configEnd;
}

static configStreamerResult_e x32FlashStatusToConfigResult(uint32_t status)
{
    switch (status) {
    case FLASH_SUCCESS:
        return CONFIG_RESULT_SUCCESS;
    case FLASH_BUS_ADDR_ERROR:
    case FLASH_LOGIC_ADDR_ERROR:
        return CONFIG_RESULT_ADDRESS_INVALID;
    case FLASH_FAILED:
        return CONFIG_RESULT_INCOMPLETE;
    default:
        return CONFIG_RESULT_FAILURE;
    }
}

static configStreamerResult_e x32EraseFlashIfNeeded(uintptr_t address)
{
    if ((address % X32_FLASH_ERASE_SIZE) != 0) {
        return CONFIG_RESULT_SUCCESS;
    }

    return x32FlashStatusToConfigResult(SMU_EraseFlash((uint32_t)address));
}
#endif

void configUnlock(void)
{
#if defined(STM32F7) || defined(STM32H7) || defined(STM32H5) || defined(STM32C5) || defined(STM32G4)
    HAL_FLASH_Unlock();
#elif defined(X32M7)
    // NOP
#elif defined(APM32F4)
    DAL_FLASH_Unlock();
#elif defined(AT32F4)
    flash_unlock();
#elif defined(GD32F4)
    fmc_unlock();
#else
    FLASH_Unlock();
#endif
}

void configLock(void)
{
#if defined(STM32F7) || defined(STM32H7) || defined(STM32H5) || defined(STM32C5) || defined(STM32G4)
        HAL_FLASH_Lock();
#if defined(STM32H5)
        // On H5 the instruction cache also caches const/data reads from the
        // flash code region, which includes the config storage area. After
        // rewriting config, invalidate ICACHE so subsequent reads are coherent
        // instead of being served from stale cache lines.
        HAL_ICACHE_Invalidate();
#endif
#if defined(STM32C5)
        // On C5 the instruction cache also caches const/data reads from the
        // flash code region, which includes the config storage area. After
        // rewriting config, invalidate ICACHE so subsequent reads are coherent
        // instead of being served from stale cache lines. CMSIS-direct (the C5
        // HAL2 has no ICACHE wrapper); bounded wait so a stuck flag can't hang.
        //
        // Clear any stale busy-end flag first (e.g. left set by the power-on
        // auto-invalidation) — otherwise the wait below would see BSYENDF
        // already set and exit before THIS invalidation completes, leaving the
        // cache with stale config lines.
        WRITE_REG(ICACHE->FCR, ICACHE_FCR_CBSYENDF);
        SET_BIT(ICACHE->CR, ICACHE_CR_CACHEINV);
        for (volatile uint32_t icacheWait = 0;
             icacheWait < 1000000U && !(ICACHE->SR & ICACHE_SR_BSYENDF);
             icacheWait++) { }
        WRITE_REG(ICACHE->FCR, ICACHE_FCR_CBSYENDF);
        __DSB();
        __ISB();
#endif
#elif defined(X32M7)
        // NOP
#elif defined(AT32F4)
        flash_lock();
#elif defined(APM32F4)
        DAL_FLASH_Lock();
#elif defined(GD32F4)
        fmc_lock();
#else
        FLASH_Lock();
#endif
}

void configClearFlags(void)
{
#if defined(STM32F4)
    FLASH_ClearFlag(FLASH_FLAG_EOP | FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR | FLASH_FLAG_PGAERR | FLASH_FLAG_PGPERR | FLASH_FLAG_PGSERR);
#elif defined(STM32F7)
    // NOP
#elif defined(STM32H7)
    // NOP
#elif defined(STM32H5)
    // NOP
#elif defined(STM32C5)
    // NOP
#elif defined(STM32G4)
    // NOP
#elif defined(AT32F4)
    flash_flag_clear(FLASH_ODF_FLAG | FLASH_PRGMERR_FLAG | FLASH_EPPERR_FLAG);
#elif defined(APM32F4)
    __DAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP | FLASH_FLAG_OPERR | FLASH_FLAG_WRPERR | FLASH_FLAG_PGAERR | FLASH_FLAG_PGPERR | FLASH_FLAG_PGSERR);
#elif defined(X32M7)
    // SMU flash operations return status directly.
#elif defined(UNIT_TEST) || defined(SIMULATOR_BUILD)
    // NOP
#elif defined(GD32F4)
    fmc_flag_clear(FMC_FLAG_END | FMC_FLAG_OPERR | FMC_FLAG_WPERR | FMC_FLAG_PGMERR | FMC_FLAG_PGSERR);
#else
# error "Unsupported CPU"
#endif
}

configStreamerResult_e configWriteWord(uintptr_t address, config_streamer_buffer_type_t *buffer)
{
#if defined(STM32H7)
    if (address % FLASH_PAGE_SIZE == 0) {
        FLASH_EraseInitTypeDef EraseInitStruct = {
            .TypeErase     = FLASH_TYPEERASE_SECTORS,
#if !(defined(STM32H7A3xx) || defined(STM32H7A3xxQ))
            .VoltageRange  = FLASH_VOLTAGE_RANGE_3, // 2.7-3.6V
#endif
            .NbSectors     = 1
        };
        getFLASHSectorForEEPROM(address, &EraseInitStruct.Banks, &EraseInitStruct.Sector);
        uint32_t SECTORError;
        const HAL_StatusTypeDef status = HAL_FLASHEx_Erase(&EraseInitStruct, &SECTORError);
        if (status != HAL_OK) {
            return CONFIG_RESULT_FAILURE;
        }
    }

    // For H7
    // HAL_StatusTypeDef HAL_FLASH_Program(uint32_t TypeProgram, uint32_t Address, uint32_t DataAddress);
    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == sizeof(uint32_t) * FLASH_NB_32BITWORD_IN_FLASHWORD,  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");
    const HAL_StatusTypeDef status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_FLASHWORD, address, (uint32_t)buffer);
    if (status != HAL_OK) {
        return CONFIG_RESULT_ADDRESS_INVALID;
    }
#elif defined(STM32F7)
    if (address % FLASH_PAGE_SIZE == 0) {
        FLASH_EraseInitTypeDef EraseInitStruct = {
            .TypeErase     = FLASH_TYPEERASE_SECTORS,
            .VoltageRange  = FLASH_VOLTAGE_RANGE_3, // 2.7-3.6V
            .NbSectors     = 1
        };
        EraseInitStruct.Sector = getFLASHSectorForEEPROM();
        uint32_t SECTORError;
        const HAL_StatusTypeDef status = HAL_FLASHEx_Erase(&EraseInitStruct, &SECTORError);
        if (status != HAL_OK) {
            return CONFIG_RESULT_FAILURE;
        }
    }

    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == sizeof(uint32_t),  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");
    // For F7
    // HAL_StatusTypeDef HAL_FLASH_Program(uint32_t TypeProgram, uint32_t Address, uint64_t Data);
    const HAL_StatusTypeDef status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address, *buffer);
    if (status != HAL_OK) {
        return CONFIG_RESULT_INCOMPLETE;
    }
#elif defined(STM32H5)
    if (address % FLASH_PAGE_SIZE == 0) {
        FLASH_EraseInitTypeDef EraseInitStruct = {
            .TypeErase     = FLASH_TYPEERASE_SECTORS,
            .NbSectors     = 1
        };
        getFLASHSectorForEEPROM(address, &EraseInitStruct.Banks, &EraseInitStruct.Sector);
        uint32_t SECTORError;
        const HAL_StatusTypeDef status = HAL_FLASHEx_Erase(&EraseInitStruct, &SECTORError);
        if (status != HAL_OK) {
            return CONFIG_RESULT_FAILURE;
        }
    }

    // H5 programs 128 bits (quad-word) at a time; DataAddress points to 4 x uint32_t
    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == 16,  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");
    const HAL_StatusTypeDef status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_QUADWORD, address, (uint32_t)buffer);
    if (status != HAL_OK) {
        return CONFIG_RESULT_ADDRESS_INVALID;
    }
#elif defined(STM32G4)
    if (address % FLASH_PAGE_SIZE == 0) {

